app/controllers/api/podcasts_controller.rb

    def index
        @podcasts = Podcast.all
---
SELECT "podcasts".* FROM "podcasts"

    def show
        @podcast = Podcast.find(params[:id])
---
SELECT  "podcasts".* FROM "podcasts" WHERE "podcasts"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]