app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "X2KyGNMm_ToPKTyGho4y-g"], ["updated_at", "2020-04-08 18:33:27.007494"], ["id", 4]]
---
    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save